<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
        <link href="./css/style.css" rel="stylesheet" type="text/css" media="screen" />
        <title>Pandora's Box Graphics Engine</title>
    </head>
    <body>
    <div id="wrapper">
        <div id="logo">
	        <h1><a name="topo">Pandora's Box Graphics Engine: Uma Engine Gr&aacute;fica com Aplica&ccedil;&atilde;o em Visualiza&ccedil;&atilde;o de Campos Tensoriais </a></h1>
        </div>
        <div id="header">
	        <div id="menu">
		        <ul>
			        <li><a href="#resumo">Resumo da monografia</a></li>
			        <li><a href="#objetivos">Objetivos do trabalho</a></li>
			        <li><a href="#atividades">Atividades j&aacute; realizadas</a></li>
			        <li><a href="#cronograma">Cronograma de Atividades</a></li>
			        <li><a href="#estrutura">Estrutura esperada da monografia</a></li>
                    <li><a href="#bibliografia">Bibliografia</a></li>
		        </ul>
	        </div>
	        <div id="gallery"><img src="css/images/diff-tensro_RTRT1.jpg" width="346" height="340" alt="" /><img src="css/images/MRI-DTIBrain-9223.jpg" width="346" height="340" alt="" /></div>
        </div>
        <div id="page">
	    <div id="page-bgtop">
		<div id="content">
        <h1 class="title" style="padding-bottom: 15px">Proposta de Monografia</h1>
        <table style="font-size: 16px">
            <tr><td style="padding-right: 30px">Andrew Toshiaki Nakayama Kurauchi</td><td>5894035</td></tr>
            <tr><td>Victor Kendy Harada</td><td style="text-align: center">5893823</td></tr>
        </table>
        <p style="font-size: 16px; padding-bottom: 20px"><i>Supervisor:</i>&nbsp;&nbsp;Prof. Dr. Marcel Parolin Jackowski</p>

        <div class="post">
        <h2 class="title"><a name="resumo">Resumo da monografia</a></h2>
        <a href="#topo">Voltar para o topo</a>        
        <p class="meta" />
        <p>O desenvolvimento de programas de computa&ccedil;&atilde;o gr&aacute;fica em tempo real exige a aplica&ccedil;&atilde;o de um vasto conjunto de t&eacute;cnicas de otimiza&ccedil;&atilde;o que s&atilde;o recorrentes em diversas aplica&ccedil;&otilde;es. Por esse motivo s&atilde;o desenvolvidas engines gr&aacute;ficas como OpenSceneGraph<sup>[4]</sup> e Ogre3D<sup>[5]</sup>. Entretanto, tais engines evolu&iacute;ram de tal forma que o tempo de aprendizagem &eacute; longo. O intuito desse trabalho &eacute; desenvolver uma engine gr&aacute;fica que implemente t&eacute;cnicas b&aacute;sicas de computa&ccedil;&atilde;o gr&aacute;fica e que seja f&aacute;cil de ser aprendida e utilizada.</p>

	    <p>O estudo de tensores e campos tensoriais &eacute; de import&acirc;ncia fundamental para diversas &aacute;reas do conhecimento. S&atilde;o encontradas aplica&ccedil;&otilde;es no estudo de fen&ocirc;menos s&iacute;smicos<sup>[1]</sup>, estruturas eletr&ocirc;nicas<sup>[2]</sup> e imagens de resson&acirc;ncia magn&eacute;tica sens&iacute;veis a difus&atilde;o<sup>[3]</sup>. A visualiza&ccedil;&atilde;o de tais campos &eacute;, portanto, de grande relev&acirc;ncia para o avan&ccedil;o do conhecimento. Por esse motivo uma das aplica&ccedil;&otilde;es desenvolvidas com o aux&iacute;lio da engine ser&aacute; um programa que permita tais visualiza&ccedil;&otilde;es. Ser&atilde;o utilizados para testes a visualiza&ccedil;&atilde;o da representa&ccedil;&atilde;o elipsoidal de campos tensoriais provenientes de imagens de resson&acirc;ncia magn&eacute;tica sens&iacute;veis a difus&atilde;o e campos representativos de deforma&ccedil;&otilde;es f&iacute;sicas em 3 dimens&otilde;es</p>
        </div>

        <div class="post">
        <h2 class="title"><a name="objetivos">Objetivos do trabalho</a></h2>
        <a href="#topo">Voltar para o topo</a>
        <p class="meta" />

        <p>Com o Pandora's Box Graphic Engine visa-se atingir os seguintes objetivos:</p>
        <ul>
            <li>Construir uma engine gr&aacute;fica de f&aacute;cil utiliza&ccedil;&atilde;o e aprendizado com a linguagem C++</li>
            <li>Criar uma ferramenta para a visualiza&ccedil;&atilde;o em tempo real da representa&ccedil;&atilde;o elipsoidal de campos tensoriais em 3 dimens&otilde;es</li>
        </ul>
	    </div>

        <div class="post">
        <h2 class="title"><a name="atividades">Atividades j&aacute; realizadas</a></h2>
        <a href="#topo">Voltar para o topo</a>
        <p class="meta" />

	    <p>As seguintes atividades j&aacute; foram desenvolvidas:</p>
	    <ul>
            <li>Estudo inicial sobre tensores e visualiza&ccedil;&atilde;o de campos tensoriais</li>
            <li>
                Codifica&ccedil;&atilde;o da estrutura geral da engine:
                <ul>
                    <li>Renderizador</li>
                    <li>Grafo de cena</li>
                    <li>Gerenciador de janelas</li>
                    <li>C&acirc;mera</li>
                    <li>Transforma&ccedil;&otilde;es lineares</li>
                    <li>Modelos</li>
                    <li>Luzes</li>
                    <li>Suporte a shaders customizados</li>
                </ul>
            </li>
            <li>Leitura de campos tensoriais representados em arquivos no formato Analyze<sup>&reg;[6]</sup></li>
            <li>C&aacute;lculo dos autovalores e autovetores dos tensores e renderiza&ccedil;&atilde;o da representa&ccedil;&atilde;o elipsoidal de tensores</li>
        </ul>
        </div>

        <div class="post">
        <h2 class="title"><a name="cronograma">Cronograma de Atividades</a></h2>
        <a href="#topo">Voltar para o topo</a>
        <p class="meta" />

        <table>
            <tr><td>Janeiro de 2011</td><td>Defini&ccedil;&atilde;o e cria&ccedil;&atilde;o dos n&oacute;s do grafo de cena que ser&atilde;o inicialmente suportados</td></tr>
            <tr><td>Fevereiro de 2011</td><td>Implementa&ccedil;&atilde;o do buffer de v&eacute;rtices e do renderizador do grafo de cena</td></tr>
            <tr><td>Mar&ccedil;o de 2011</td><td>Implementa&ccedil;&atilde;o da classe respons&aacute;vel por gerenciar os shaders e cria&ccedil;&atilde;o de modelos geom&eacute;tricos b&aacute;sicos</td></tr>
            <tr><td>Abril de 2011</td><td>Suporte inicial a texturas e cria&ccedil;&atilde;o de m&eacute;todos que calculam autovalores e autovetores de matrizes 3x3</td></tr>
            <tr><td>Maio de 2011</td><td>Suporte a renderiza&ccedil;&atilde;o eficiente de v&aacute;rias inst&acirc;ncias de um mesmo modelo (renderiza&ccedil;&atilde;o instanciada) e a arquivos Analyze<sup>&reg;</sup> (representa&ccedil;&atilde;o de campos tensoriais) e vers&atilde;o inicial da visualiza&ccedil;&atilde;o do campo</td></tr>
            <tr><td>Junho de 2011</td><td>Implementa&ccedil;&atilde;o da t&eacute;cnica de renderiza&ccedil;&atilde;o em texturas e iniciar modifica&ccedil;&otilde;es na engine para utilizar a t&eacute;cnica de ilumina&ccedil;&atilde;o deferida e aplica&ccedil;&atilde;o das t&eacute;cnicas de renderiza&ccedil;&atilde;o instanciada e outras otimiza&ccedil;&otilde;es na visualiza&ccedil;&atilde;o do campo tensorial</td></tr>
            <tr><td>Julho de 2011</td><td>Continua&ccedil;&atilde;o da implementa&ccedil;&atilde;o do suporte a ilumina&ccedil;&atilde;o deferida e adicionar suporte a p&oacute;s-processamento da cena renderizada e implementa&ccedil;&atilde;o de um jogo simples como exemplo de utiliza&ccedil;&atilde;o gen&eacute;rica da engine</td></tr>
            <tr><td>Agosto de 2011</td><td>Desenvolvimento de mais exemplos de uso e implementa&ccedil;&atilde;o de frustum culling na engine</td></tr>
            <tr><td>Setembro de 2011</td><td>Limpeza de c&oacute;digo e, se houver disponibilidade de tempo, adicionar suporte a modelos transl&uacute;cidos</td></tr>
        </table>
        </div>

        <div class="post">
        <h2 class="title"><a name="estrutura">Estrutura esperada da monografia</a></h2>
        <a href="#topo">Voltar para o topo</a>
        <p class="meta" />

    	<h3>Introdu&ccedil;&atilde;o</h3>
		<p>Apresenta&ccedil;&atilde;o de engines gr&aacute;ficas alternativas existentes e os motivos para a cria&ccedil;&atilde;o de mais uma alternativa. Import&acirc;ncia da visualiza&ccedil;&atilde;o de campos tensoriais e como uma engine gr&aacute;fica pode auxiliar o desenvolvimento de aplica&ccedil;&otilde;es com tal prop&oacute;sito.</p>

	    <h3>Conceitos e tecnologias estudadas</h3>
		<p>Conceitos utilizados na implementa&ccedil;&atilde;o da engine, assim como tensores e suas formas de visualiza&ccedil;&atilde;o. Al&eacute;m de uma breve introdu&ccedil;&atilde;o ao OpenGL e C++.</p>

        <h3>Atividades realizadas</h3>
		<p>Id&eacute;ias aplicadas na solu&ccedil;&atilde;o dos problemas.</p>

        <h3>Resultados e produtos obtidos</h3>
		<p>Trechos de c&oacute;digo relevantes e resultados obtidos.</p>

        <h3>Conclus&otilde;es</h3>
		<p>Considera&ccedil;&otilde;es e futuro do projeto desenvolvido.</p>

        <h3>Bibliografia</h3>
	    <p>Refer&ecirc;ncias bibliogr&aacute;ficas utilizadas ao longo do desenvolvimento da engine.</p>
    </div>
    </div>
    </div>
    </div>
    <div id="footer-bg">
	    <div id="footer-content">
            <h2 class="title"><a name="bibliografia">Bibliografia</a></h2>
            <a href="#topo">Voltar para o topo</a>
            <ol>
            <li>
                ENGELSMA, C.; HALE, D. CWP-655 Visualization of 3D tensor fields derived from seismic images. Center for Wave Phenomena, Colorado School of Mines, Golden, CO 80401, USA. Dispon&iacute;vel em: &lt;http://www.cwp.mines.edu/Meetings/Project10/cwp-655.pdf&gt;. Acesso em: jun. 2011.
            </li>

            <li>
                HEAD-GORDON, M. Tensor concepts in electronic structure theory:
Application to self-consistent field methods and
electron correlation techniques. <i>Modern Methods and Algorithms of Quantum Chemistry</i>,
J. Grotendorst (Ed.), John von Neumann Institute for Computing,
Js ulich, NIC Series, Vol. 1, ISBN 3-00-005618-1, p. 561-562. 2000.
            </li>

            <li>
                KINGSLEY, P. B. Introduction to diffusion tensor imaging mathematics: Part I. Tensors, rotations, and eigenvectors. <i>Concepts in Magnetic Resonance Part A</i>, New York, v. 28A, n. 2, p. 101-122, mar. 2006.
            </li>

            <li>
                OpenSceneGraph. Dispon&iacute;vel em: &lt;http://www.openscenegraph.org&gt;. Acesso em: mai. 2011.
            </li>

            <li>
                Ogre3D. Dispon&iacute;vel em: &lt;http://www.ogre3d.org&gt;. Acesso em: mai. 2011.
            </li>

            <li>
                Mayo/SPM "Analyze" Format Spec Compilation. Dispon&iacute;vel em: &lt;http://www.grahamwideman.com/gw/brain/analyze/formatdoc.htm&gt;. Acesso em: jun. 2011.
            </li>

            <li>
                OpenGL 2.1 Reference Pages. Dispon&iacute;vel em: &lt;http://www.opengl.org/sdk/docs/man&gt;. Acesso em: jun. 2011.
            </li>

            <li>
                OpenGL 3.3 Reference Pages. Dispon&iacute;vel em: &lt;http://www.opengl.org/sdk/docs/man3&gt;. Acesso em: jun. 2011.
            </li>

            <li>
                OpenGL 4.1 Reference Pages. Dispon&iacute;vel em: &lt;http://www.opengl.org/sdk/docs/man4&gt;. Acesso em: jun. 2011.
            </li>

            <li>
                CEDARS-SINAI. MRI-DTIBrain-9223.jpg. Dispon&iacute;vel em: &lt;http://www.cedars-sinai.edu/Medical-Professionals/Imaging-Center/Neuroradiology/MRI-with-DTI.aspx&gt;. Acesso em: jun. 2011.
            </li>
            </ol>
	    </div>
    </div>    
    <div id="footer" />
    </body>
</html>
